In [1]:
import requests
import xml.etree.ElementTree as ET
import pandas as pd
from urllib import parse
import pymysql

ModuleNotFoundError: No module named 'pymysql'

In [138]:
url = "http://openapi.airport.co.kr/service/rest/FlightScheduleList/getIflightScheduleList?serviceKey=WRvGBkn9UEtw%2BAsg0tYo210Etxvb1QEcAX%2BwfWvOxVGYJkh1CNZ%2FY4QFa0r7j4bhT4NjPu7z1i1ck8ZgsKMt2Q%3D%3D&schDate=20151005&numOfRows=5000"

In [139]:
result = parse.urlparse(url)

In [140]:
result

ParseResult(scheme='http', netloc='openapi.airport.co.kr', path='/service/rest/FlightScheduleList/getIflightScheduleList', params='', query='serviceKey=WRvGBkn9UEtw%2BAsg0tYo210Etxvb1QEcAX%2BwfWvOxVGYJkh1CNZ%2FY4QFa0r7j4bhT4NjPu7z1i1ck8ZgsKMt2Q%3D%3D&schDate=20151005&numOfRows=5000', fragment='')

In [141]:
result.geturl()

'http://openapi.airport.co.kr/service/rest/FlightScheduleList/getIflightScheduleList?serviceKey=WRvGBkn9UEtw%2BAsg0tYo210Etxvb1QEcAX%2BwfWvOxVGYJkh1CNZ%2FY4QFa0r7j4bhT4NjPu7z1i1ck8ZgsKMt2Q%3D%3D&schDate=20151005&numOfRows=5000'

In [142]:
result.scheme

'http'

In [143]:
result[0]

'http'

In [144]:
result.hostname

'openapi.airport.co.kr'

In [145]:
result.path

'/service/rest/FlightScheduleList/getIflightScheduleList'

In [146]:
result.query

'serviceKey=WRvGBkn9UEtw%2BAsg0tYo210Etxvb1QEcAX%2BwfWvOxVGYJkh1CNZ%2FY4QFa0r7j4bhT4NjPu7z1i1ck8ZgsKMt2Q%3D%3D&schDate=20151005&numOfRows=5000'

* ParseResult를 사용하여 url주소 구조 완성

In [147]:
parse_result = parse.ParseResult(scheme  = result.scheme, netloc= result.hostname, path=result.path, 
                 params = result.params, query=result.query, fragment=result.fragment)

In [148]:
parse_result

ParseResult(scheme='http', netloc='openapi.airport.co.kr', path='/service/rest/FlightScheduleList/getIflightScheduleList', params='', query='serviceKey=WRvGBkn9UEtw%2BAsg0tYo210Etxvb1QEcAX%2BwfWvOxVGYJkh1CNZ%2FY4QFa0r7j4bhT4NjPu7z1i1ck8ZgsKMt2Q%3D%3D&schDate=20151005&numOfRows=5000', fragment='')

* urlunparse() 메소드를 사용하여 주소 형태로 전달

In [149]:
parse.urlunparse(parse_result)

'http://openapi.airport.co.kr/service/rest/FlightScheduleList/getIflightScheduleList?serviceKey=WRvGBkn9UEtw%2BAsg0tYo210Etxvb1QEcAX%2BwfWvOxVGYJkh1CNZ%2FY4QFa0r7j4bhT4NjPu7z1i1ck8ZgsKMt2Q%3D%3D&schDate=20151005&numOfRows=5000'

## 주소의 파라미터 수정하기

In [150]:
query_dict = parse.parse_qs(result.query)

In [151]:
query_dict

{'serviceKey': ['WRvGBkn9UEtw+Asg0tYo210Etxvb1QEcAX+wfWvOxVGYJkh1CNZ/Y4QFa0r7j4bhT4NjPu7z1i1ck8ZgsKMt2Q=='],
 'schDate': ['20151005'],
 'numOfRows': ['5000']}

### doseq 옵션
* False가 기본값이며, dict의 value값의 []까지 인코딩을 한다. 
* True로 설정하면 실제 값만 인코딩을 한다

In [16]:
parse.urlencode(query_dict, doseq=True)

'serviceKey=WRvGBkn9UEtw%2BAsg0tYo210Etxvb1QEcAX%2BwfWvOxVGYJkh1CNZ%2FY4QFa0r7j4bhT4NjPu7z1i1ck8ZgsKMt2Q%3D%3D&schDate=20151005&numOfRows=5000'

In [17]:
api_url = parse.ParseResult(scheme  = result.scheme, netloc= result.hostname, path=result.path, 
                 params = result.params, query=parse.urlencode(query_dict, doseq=True), fragment=result.fragment)

In [18]:
url = parse.urlunparse(api_url)

In [19]:
print (url)

http://openapi.airport.co.kr/service/rest/FlightScheduleList/getIflightScheduleList?serviceKey=WRvGBkn9UEtw%2BAsg0tYo210Etxvb1QEcAX%2BwfWvOxVGYJkh1CNZ%2FY4QFa0r7j4bhT4NjPu7z1i1ck8ZgsKMt2Q%3D%3D&schDate=20151005&numOfRows=5000

## xml 파싱

In [20]:
r = requests.get(url)

In [21]:
root = ET.fromstring(r.text)

In [22]:
total = []
items = root.iter(tag='item')
for element in items:
    #print(element.find("accDefRate").text)
    covid_dict = {}
    for x in element:
        covid_dict[x.tag] = x.text
    total.append(covid_dict)

In [23]:
len(total)

454

In [24]:
df = pd.DataFrame(total)

In [25]:
df.head(2)

,airlineKorean,airport,city,internationalEddate,internationalFri,internationalIoType,internationalMon,internationalNum,internationalSat,internationalStdate,internationalSun,internationalThu,internationalTime,internationalTue,internationalWed
0,이스타항공,청주,상해/푸동,2015-10-24T00:00:00+09:00,N,IN,N,ZE822,N,2015-07-21T00:00:00+09:00,Y,Y,0230,N,N
1,제주항공,대구,북경/베이징,2015-10-24T00:00:00+09:00,N,IN,N,7C8102,Y,2015-03-29T00:00:00+09:00,N,Y,0510,Y,N

In [26]:
df = df.where(~(df == "null"), None)

In [27]:
df.head(2)

,airlineKorean,airport,city,internationalEddate,internationalFri,internationalIoType,internationalMon,internationalNum,internationalSat,internationalStdate,internationalSun,internationalThu,internationalTime,internationalTue,internationalWed
0,이스타항공,청주,상해/푸동,2015-10-24T00:00:00+09:00,N,IN,N,ZE822,N,2015-07-21T00:00:00+09:00,Y,Y,0230,N,N
1,제주항공,대구,북경/베이징,2015-10-24T00:00:00+09:00,N,IN,N,7C8102,Y,2015-03-29T00:00:00+09:00,N,Y,0510,Y,N

In [28]:
df = df.where(pd.notnull(df), None)

In [29]:
from datetime import date, datetime

In [30]:
datetime.strptime('2015-07-21T00:00:00', '%Y-%m-%dT%H:%M:%S')

datetime.datetime(2015, 7, 21, 0, 0)

In [31]:
df['internationalStdate']

0      2015-07-21T00:00:00+09:00
1      2015-03-29T00:00:00+09:00
2      2015-08-16T00:00:00+09:00
3      2015-10-02T00:00:00+09:00
4      2015-09-25T00:00:00+09:00
                 ...
449    2015-08-16T00:00:00+09:00
450    2015-03-29T00:00:00+09:00
451    2015-10-03T00:00:00+09:00
452    2015-08-16T00:00:00+09:00
453    2015-08-16T00:00:00+09:00
Name: internationalStdate, Length: 454, dtype: object

In [32]:
df['internationalStdate'] = df['internationalStdate'].apply(lambda x: x[:10])

In [33]:
df['internationalEddate'] = df['internationalEddate'].apply(lambda x: x[:10])

In [34]:
df.head(3)

,airlineKorean,airport,city,internationalEddate,internationalFri,internationalIoType,internationalMon,internationalNum,internationalSat,internationalStdate,internationalSun,internationalThu,internationalTime,internationalTue,internationalWed
0,이스타항공,청주,상해/푸동,2015-10-24,N,IN,N,ZE822,N,2015-07-21,Y,Y,0230,N,N
1,제주항공,대구,북경/베이징,2015-10-24,N,IN,N,7C8102,Y,2015-03-29,N,Y,0510,Y,N
2,아시아나,청주,북경/베이징,2015-10-24,Y,IN,N,OZ3745,N,2015-08-16,Y,N,0525,N,Y

In [35]:
df.keys()

Index(['airlineKorean', 'airport', 'city', 'internationalEddate',
       'internationalFri', 'internationalIoType', 'internationalMon',
       'internationalNum', 'internationalSat', 'internationalStdate',
       'internationalSun', 'internationalThu', 'internationalTime',
       'internationalTue', 'internationalWed'],
      dtype='object')

# 2019, 2020년 데이터 모으기

In [82]:
query_dict

{'serviceKey': ['WRvGBkn9UEtw+Asg0tYo210Etxvb1QEcAX+wfWvOxVGYJkh1CNZ/Y4QFa0r7j4bhT4NjPu7z1i1ck8ZgsKMt2Q=='],
 'schDate': ['20151005'],
 'numOfRows': ['5000']}

In [ ]:
total = []

In [ ]:
for x in pd.date_range('2019-01-01', '2020-12-10'):
    print(x)
    query_dict['schDate']  = x.strftime("%Y-%m-%d").replace("-", "")
    api_url = parse.ParseResult(scheme  = result.scheme, netloc= result.hostname, path=result.path, 
                 params = result.params, query=parse.urlencode(query_dict, doseq=True), fragment=result.fragment)
    url = parse.urlunparse(api_url)
    r = requests.get(url)
    root = ET.fromstring(r.text)

    items = root.iter(tag='item')
    for element in items:
        #print(element.find("accDefRate").text)
        covid_dict = {}
        for x in element:
            covid_dict[x.tag] = x.text
        total.append(covid_dict)

In [96]:
df = pd.DataFrame(total)

In [97]:
df.shape

(391075, 15)

In [102]:
df2 = df.drop_duplicates().copy()

In [111]:
df2.to_csv("airport_schedule.csv", index=False, encoding='utf-8-sig')

In [103]:
df2.shape

(4259, 15)

In [104]:
df2['internationalStdate'] = df2['internationalStdate'].apply(lambda x: x[:10])
df2['internationalEddate'] = df2['internationalEddate'].apply(lambda x: x[:10])

In [109]:
df2['year'] =df2['internationalStdate'].apply(lambda x : x[:4])

In [110]:
df2['year'].value_counts()

2019    2869
2018     871
2020     519
Name: year, dtype: int64

## Database 연결 및 Create, Insert

GRANT ALL PRIVILEGES ON *.* TO 'root'@'%' IDENTIFIED BY '12345'

In [112]:
try:
    con = pymysql.connect(host='192.168.56.21', user='root', port=3306, password='12345',   db='sqoop', charset='utf8')
    cur = con.cursor()
except Exception as e:
    print (e)

In [113]:
for name in df.keys():
    print("`{}`".format(name))

`airlineKorean`
`airport`
`city`
`internationalEddate`
`internationalFri`
`internationalIoType`
`internationalMon`
`internationalNum`
`internationalSat`
`internationalStdate`
`internationalSun`
`internationalThu`
`internationalTime`
`internationalTue`
`internationalWed`

In [124]:
create_table = """
    CREATE TABLE airport_info (
       `airlineKorean`        VARCHAR(20),
        `airport`             VARCHAR(20), 
        `city`                VARCHAR(20),
        `internationalEddate` DATETIME,
        `internationalFri`    VARCHAR(1),
        `internationalIoType` VARCHAR(3),
        `internationalMon`    VARCHAR(1),
        `internationalNum`    VARCHAR(10),  
        `internationalSat`    VARCHAR(1),
        `internationalStdate` DATETIME,
        `internationalSun`    VARCHAR(1),
        `internationalThu`    VARCHAR(1),
        `internationalTime`   TIME,
        `internationalTue`    VARCHAR(1),
        `internationalWed`    VARCHAR(1),
        `year`                VARCHAR(4)
    ) COLLATE='utf8mb4_general_ci'
"""

In [125]:
print(create_table)

    CREATE TABLE airport_info (
       `airlineKorean`        VARCHAR(20),
        `airport`             VARCHAR(20),
        `city`                VARCHAR(20),
        `internationalEddate` DATETIME,
        `internationalFri`    VARCHAR(1),
        `internationalIoType` VARCHAR(3),
        `internationalMon`    VARCHAR(1),
        `internationalNum`    VARCHAR(10),
        `internationalSat`    VARCHAR(1),
        `internationalStdate` DATETIME,
        `internationalSun`    VARCHAR(1),
        `internationalThu`    VARCHAR(1),
        `internationalTime`   TIME,
        `internationalTue`    VARCHAR(1),
        `internationalWed`    VARCHAR(1),
        `year`                VARCHAR(4)
    ) COLLATE='utf8mb4_general_ci'

In [126]:
cur.execute(create_table)

0

In [127]:
con.commit()

In [128]:
for name in df.keys():
    print("{}".format(name), end = ", ")

airlineKorean, airport, city, internationalEddate, internationalFri, internationalIoType, internationalMon, internationalNum, internationalSat, internationalStdate, internationalSun, internationalThu, internationalTime, internationalTue, internationalWed,

In [135]:
sql = """INSERT INTO airport_info (airlineKorean, airport, city, internationalEddate, internationalFri, internationalIoType, internationalMon, 
                              internationalNum, internationalSat, internationalStdate,
                              internationalSun, internationalThu, internationalTime, internationalTue, internationalWed, year) VALUES
         (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
"""

In [136]:
for row in df2.iterrows():
    try:
        cur.execute(sql, row[1].tolist())
    except Exception as e:
        print(e)
        break
        
con.commit()